In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [5]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0] = None

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [10]:
from numpy import nan as NA

In [11]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [15]:
cleaned = data.dropna()

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [18]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [104]:
Data[4] = NA

NameError: name 'Data' is not defined

In [19]:
data[4] = NA

In [20]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
df = pd.DataFrame(np.random.randn(7, 3))

In [23]:
df.iloc[:4, 1] = NA

In [24]:
df.iloc[:2, 2] = NA

In [25]:
df

          0         1         2
0 -0.104629       NaN       NaN
1 -0.956555       NaN       NaN
2 -0.354879       NaN  0.055601
3 -0.250953       NaN -0.325007
4  0.666101 -0.559159 -1.024273
5  0.085942  1.172284 -1.732454
6 -0.857775  2.117211 -1.579668

In [26]:
df.dropna()

          0         1         2
4  0.666101 -0.559159 -1.024273
5  0.085942  1.172284 -1.732454
6 -0.857775  2.117211 -1.579668

In [27]:
df.dropna(thresh=2)

          0         1         2
2 -0.354879       NaN  0.055601
3 -0.250953       NaN -0.325007
4  0.666101 -0.559159 -1.024273
5  0.085942  1.172284 -1.732454
6 -0.857775  2.117211 -1.579668

In [28]:
df.fillna(0)

          0         1         2
0 -0.104629  0.000000  0.000000
1 -0.956555  0.000000  0.000000
2 -0.354879  0.000000  0.055601
3 -0.250953  0.000000 -0.325007
4  0.666101 -0.559159 -1.024273
5  0.085942  1.172284 -1.732454
6 -0.857775  2.117211 -1.579668

In [29]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.104629  0.500000  0.000000
1 -0.956555  0.500000  0.000000
2 -0.354879  0.500000  0.055601
3 -0.250953  0.500000 -0.325007
4  0.666101 -0.559159 -1.024273
5  0.085942  1.172284 -1.732454
6 -0.857775  2.117211 -1.579668

In [30]:
_ = df.fillna(0, inplace=True)

In [31]:
df

          0         1         2
0 -0.104629  0.000000  0.000000
1 -0.956555  0.000000  0.000000
2 -0.354879  0.000000  0.055601
3 -0.250953  0.000000 -0.325007
4  0.666101 -0.559159 -1.024273
5  0.085942  1.172284 -1.732454
6 -0.857775  2.117211 -1.579668

In [32]:
df = pd.DataFrame(np.random.randn(6, 3))

In [33]:
df.iloc[2:, 1] = NA

In [34]:
df.iloc[4:, 2] = NA

In [35]:
df

          0         1         2
0  0.550175  1.007374 -0.541186
1 -0.048297  0.750667  0.086038
2  0.532612       NaN  0.190591
3  0.412599       NaN  0.662678
4  1.093955       NaN       NaN
5  0.363123       NaN       NaN

In [36]:
df.fillna(method='ffill')

          0         1         2
0  0.550175  1.007374 -0.541186
1 -0.048297  0.750667  0.086038
2  0.532612  0.750667  0.190591
3  0.412599  0.750667  0.662678
4  1.093955  0.750667  0.662678
5  0.363123  0.750667  0.662678

In [37]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.550175  1.007374 -0.541186
1 -0.048297  0.750667  0.086038
2  0.532612  0.750667  0.190591
3  0.412599  0.750667  0.662678
4  1.093955       NaN  0.662678
5  0.363123       NaN  0.662678

In [38]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.550175  1.007374 -0.541186
1 -0.048297  0.750667  0.086038
2  0.532612  0.750667  0.190591
3  0.412599  0.750667  0.662678
4  1.093955       NaN  0.662678
5  0.363123       NaN  0.662678

In [39]:
data.fillna(data.mean())

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  6.5  3.0 NaN
2  1.0  6.5  3.0 NaN
3  1.0  6.5  3.0 NaN

In [40]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [41]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [42]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [43]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [44]:
data['v1'] = range(7)

In [45]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [46]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [47]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [48]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.033912     0.073733    -0.011243    -0.017686
std       1.021470     0.989261     0.989109     1.028611
min      -3.632047    -3.483028    -2.944434    -3.485565
25%      -0.661976    -0.570328    -0.667734    -0.693825
50%       0.027482     0.097086    -0.001540     0.011974
75%       0.722903     0.759118     0.626774     0.667862
max       3.318683     2.716959     2.927372     3.949609

In [49]:
col = data[2]

In [50]:
col[np.abs(col) > 3]

Series([], Name: 2, dtype: float64)

In [51]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
149 -3.018345  0.153335  0.566627  0.884415
156  0.143592 -3.483028 -0.144268  1.403098
183  0.068131  1.377678  0.397214  3.949609
214 -2.058490 -1.103549  0.207997  3.458380
277 -3.322952 -0.742068  0.345667  0.082709
282  1.612719  0.071020  1.218073 -3.485565
690 -3.356192  0.632459 -0.587139  2.149979
790  0.906409  1.426619 -0.529144 -3.026570
831  3.318683  1.623827  0.022479  0.063567
907 -3.632047 -0.254838  0.219848  1.233567
979  2.691743 -1.792461 -1.493725 -3.030235

In [52]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [53]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.034923     0.074216    -0.011243    -0.018551
std       1.016218     0.987639     0.989109     1.022225
min      -3.000000    -3.000000    -2.944434    -3.000000
25%      -0.661976    -0.570328    -0.667734    -0.693825
50%       0.027482     0.097086    -0.001540     0.011974
75%       0.722903     0.759118     0.626774     0.667862
max       3.000000     2.716959     2.927372     3.000000

In [54]:
Np.sign(data).head()

NameError: name 'Np' is not defined

In [55]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0 -1.0
1  1.0  1.0  1.0  1.0
2 -1.0  1.0  1.0 -1.0
3 -1.0  1.0  1.0 -1.0
4  1.0 -1.0 -1.0 -1.0

In [56]:
val = 'a,b, guido'

In [57]:
val.split(',')

['a', 'b', ' guido']

In [58]:
pieces = [x.strip() for x in val.split(',')]

In [59]:
pieces

['a', 'b', 'guido']

In [60]:
first, second, third = pieces

In [61]:
first + '::' + second + '::' + third

'a::b::guido'

In [62]:
'::'.join(pieces)

'a::b::guido'

In [63]:
'guido' in val

True

In [64]:
val.index(',')

1

In [65]:
val.find(':')

-1

In [66]:
val.index(':')

ValueError: substring not found

In [103]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

error: invalid group reference 1 at position 11

In [67]:
val.count(',')

2

In [68]:
val.replace(',', '::')

'a::b:: guido'

In [69]:
val.replace(',', '')

'ab guido'

In [70]:
import re

In [71]:
text = "foo bar\t baz \tqux"

In [72]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [73]:
regex = re.compile('\s+')

In [74]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [75]:
regex.findall(text)

[' ', '\t ', ' \t']

In [76]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [77]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [78]:
m = regex.search(text)

In [79]:
m

In [80]:
text[m.start():m.end()]

'dave@google.com'

In [81]:
print(regex.match(text))

None

In [82]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [83]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [84]:
m= regex.match('wesm@bright.net')

In [85]:
m.groups()

()

In [86]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [91]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

error: invalid group reference 1 at position 11

In [102]:
aaad

NameError: name 'aaad' is not defined

In [92]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [93]:
data = pd.Series(data)

In [94]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [95]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [96]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [97]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [98]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [99]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [100]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [101]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64